# coding: utf-8

# το 'coding: utf-8' χρησιμεύει για να μπορούμε να γράφουμε Ελληνικά στο πρόγραμμα μας 

"""
όταν λέμε μέσα στην if/elif/else εννοούμε τις εντολές που βρίσκονται κάτω από
από την if/elif/else και έχουν λίγο κενό στην αρχή, μόλις φτάσουμε στην επόμενη
εντολή που δεν έχει κενό στην αρχή, σημαίνει οτι έχουμε πλεόν βγεί από
την if/elif/else και προχωρήσαμε στην επόμενη εντολή. το (if) το χρησιμοποιούμε για
την πρώτη περίπτωση/συνθήκη συνήθως και την (elif -> else if) την χρησιμοποιούμε
για τις ενδυάμεσες περιπτώσεις/συνθήκες και όταν δεν έχουν μείνει πλέον άλλες περιπτώσεις/συνθήκες
να καλύψουμε, αλλά θέλουμε να είμαστε όσο το δυνατό πιο σίγουροι οτι τις καλύψαμε όλες,
χρησιμοποιούμε την (else) η οποία θα τρέξει σε περίπτωση που δεν ισχύει καμία από τις παραπάνω
περιπτώσεις/συνθήκες.
"""

"""
1) Το 'int' το χρησιμοποιούμε όταν αυτό που θα δώσει ο χρήστης από το πληκτρολόγιο είναι ακέραιος ή θέλουμε να είμαστε σίγουροι οτι θα είναι ακέραιος
2) Το 'float' το χρησιμοποιούμε όταν αυτό που θα δώσει ο χρήστης από το πληκτρολόγιο είναι πραγματικός ή θέλουμε να είμαστε σίγουροι οτι θα είναι πραγματικός
3) Το 'string' το χρησιμοποιούμε όταν αυτό που θα δώσει ο χρήστης από το πληκτρολόγιο είναι κείμενο ή θέλουμε να είμαστε σίγουροι οτι θα είναι κείμενο
"""


# !!! Τα παραπάνω είναι σχόλια δεν χρησιμεύουν σε κάτι, Πέρα από το να βοηθάνε τον προγραμματιστή που γράφει το πρόγραμμα. Τα σχόλια πρέπει να ξεκινάνε με αυτό το σύμβολο '#' για σχόλιο μίας γραμμής 
# !!! ή αυτό """ και ξανά αυτό """ για να κλείσει το σχόλιο αν θέλουμε να γράψουμε """σχόλιο πολλών γραμμών""" και γράφουμε ανάμεσα
# !!! Πέρα από το να βοηθάνε τον προγραμματιστή που γράφει το πρόγραμμα
# ------------------------------------------------------------------------------------------------------------------------------------------------------------



# Ζητάει από τον χρήστη να δώσει από το πληκτρολόγιο έναν Αριθμό ανάλογα την πόλη - (1) Θεσσαλονίκη, (2) Αθήνα
city = int(input("dwse polh: "))

# Ζητάει από τον χρήστη να δώσει από το πληκτρολόγιο μιά Μέρα της Εβδομάδας με Αριθμό 1-7, (1) Δευτέρα, (2) Τρίτη, κτλπ
day = int(input("dwse mera: "))

# Ζητάει από τον χρήστη να δώσει από το πληκτρολόγιο Μονά ή Ζυγά με Αριθμό, ανάλογα την πινακίδα - (1) Μονά, (2) Ζυγά
mona_zhga = int(input("dwse mona h zhga (1 h 2): "))

print "Epitrepetai na kykloforhsh stis parakatw poleis"

# Η εντολή μέσα σε αυτήν την if θα εκτελεστεί εφόσον η πόλη είναι (1), δηλαδή η Θεσσαλονίκη
if city == 1:

    # Η εντολή μέσα σε αυτήν την if θα εκτελεστεί εφόσον η μέρα είναι μία από τις μέρες Δευτέρα έως Παρασκευή, δηλαδή (1-5)
    if (day == 1) or (day == 2) or (day == 3) or (day == 4) or (day == 5):

        # Η εντολή μέσα σε αυτήν την if θα εκτελεστεί εφόσον τα mona_zhga είναι (1), δηλαδή Μονά
        if mona_zhga == 1:
            print "Ano Polh, Triandreia"
        # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί εφόσον τα mona_zhga είναι (2), δηλαδή ζυγά
        elif mona_zhga == 2:
            print "Kendro, Xarilaou"

    # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί εφόσον η μέρα είναι μία από τις μέρες του Σαββατοκύριακου, δηλαδή (6 ή 7)
    elif (day == 6) or (day == 7):

        # Η εντολή μέσα σε αυτήν την if θα εκτελεστεί εφόσον τα mona_zhga είναι (1), δηλαδή Μονά
        if mona_zhga == 1:
            print "Toumpa, Peraia"
        # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί εφόσον τα mona_zhga είναι (2), δηλαδή ζυγά
        elif mona_zhga == 2:
            print "Evosmos, Neapoli"

# Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί εφόσον η πόλη είναι (2), δηλαδή η Αθήνα
elif city == 2:

    # Η εντολή μέσα σε αυτήν την if θα εκτελεστεί εφόσον η μέρα είναι μία από τις μέρες Δευτέρα έως Παρασκευή, δηλαδή (1-5)
    if (day == 1) or (day == 2) or (day == 3) or (day == 4) or (day == 5):

        # Η εντολή μέσα σε αυτήν την if θα εκτελεστεί εφόσον τα mona_zhga είναι (1), δηλαδή Μονά
        if mona_zhga == 1:
            print "Xarilaou, Kifisia"

        # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί εφόσον τα mona_zhga είναι (2), δηλαδή ζυγά
        elif mona_zhga == 2:
            print "Glyfada, Nea Smyrni"

    # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί εφόσον η μέρα είναι μία από τις μέρες του Σαββατοκύριακου, δηλαδή (6 ή 7)
    elif (day == 6) or (day == 7):

        # Η εντολή μέσα σε αυτήν την if θα εκτελεστεί εφόσον τα mona_zhga είναι (1), δηλαδή Μονά
        if mona_zhga == 1:
            print "Kalithea, Hilton"

        # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί εφόσον τα mona_zhga είναι (2), δηλαδή ζυγά
        elif mona_zhga == 2:
            print "Zwgrafou, Ampelokhpoi"
