# coding: utf-8

# το 'coding: utf-8' χρησιμεύει για να μπορούμε να γράφουμε Ελληνικά στο πρόγραμμα μας 

"""
όταν λέμε μέσα στην if/elif/else εννοούμε τις εντολές που βρίσκονται κάτω από
από την if/elif/else και έχουν λίγο κενό στην αρχή, μόλις φτάσουμε στην επόμενη
εντολή που δεν έχει κενό στην αρχή, σημαίνει οτι έχουμε πλεόν βγεί από
την if/elif/else και προχωρήσαμε στην επόμενη εντολή. το (if) το χρησιμοποιούμε για
την πρώτη περίπτωση/συνθήκη συνήθως και την (elif -> else if) την χρησιμοποιούμε
για τις ενδυάμεσες περιπτώσεις/συνθήκες και όταν δεν έχουν μείνει πλέον άλλες περιπτώσεις/συνθήκες
να καλύψουμε, αλλά θέλουμε να είμαστε όσο το δυνατό πιο σίγουροι οτι τις καλύψαμε όλες,
χρησιμοποιούμε την (else) η οποία θα τρέξει σε περίπτωση που δεν ισχύει καμία από τις παραπάνω
περιπτώσεις/συνθήκες.
"""

"""
1) Το 'int' το χρησιμοποιούμε όταν αυτό που θα δώσει ο χρήστης από το πληκτρολόγιο είναι ακέραιος ή θέλουμε να είμαστε σίγουροι οτι θα είναι ακέραιος
2) Το 'float' το χρησιμοποιούμε όταν αυτό που θα δώσει ο χρήστης από το πληκτρολόγιο είναι πραγματικός ή θέλουμε να είμαστε σίγουροι οτι θα είναι πραγματικός
3) Το 'string' το χρησιμοποιούμε όταν αυτό που θα δώσει ο χρήστης από το πληκτρολόγιο είναι κείμενο ή θέλουμε να είμαστε σίγουροι οτι θα είναι κείμενο
"""


# !!! Τα παραπάνω είναι σχόλια δεν χρησιμεύουν σε κάτι, Πέρα από το να βοηθάνε τον προγραμματιστή που γράφει το πρόγραμμα. Τα σχόλια πρέπει να ξεκινάνε με αυτό το σύμβολο '#' για σχόλιο μίας γραμμής 
# !!! ή αυτό """ και ξανά αυτό """ για να κλείσει το σχόλιο αν θέλουμε να γράψουμε """σχόλιο πολλών γραμμών""" και γράφουμε ανάμεσα
# !!! Πέρα από το να βοηθάνε τον προγραμματιστή που γράφει το πρόγραμμα
# ------------------------------------------------------------------------------------------------------------------------------------------------------------


# Ζητάει από τον χρήστη να δώσει από το πληκτρολόγιο βαθμό για το μάθημα της Ιστορίας
grade_istoria = float(input("dwse vathmo istoria: "))

# Ζητάει από τον χρήστη να δώσει από το πληκτρολόγιο βαθμό για το μάθημα των Μαθηματικών
grade_mathimatika = float(input("dwse vathmo mathimatika: "))

# Ζητάει από τον χρήστη να δώσει από το πληκτρολόγιο βαθμό για το μάθημα της Έκθεσης
grade_ekthesh = float(input("dwse vathmo ekthesh: "))

# Υπολογίζει των μέσω όρο των βαθμών στα μαθήματα που έδωσε παραπάνω ((Ιστορία + Μαθηματικά + Έκθεση) / 3)
mo = ((grade_istoria+grade_mathimatika+grade_ekthesh) / 3)

print mo


# Η εντολή μέσα σε αυτήν την if θα εκτελεστεί εφόσον ο βαθμός στην Ιστορία ΚΑΙ ο βαθμός στα Μαθηματικά
# ΚΑΙ ο βαθμός στην Έκθεση είναι μεγαλύτερος από 9.5
if (grade_istoria > 9.5) and (grade_mathimatika > 9.5) and (grade_ekthesh > 9.5) or (mo >= 9):
    print "Perase! - Mesos Oros:", mo

# Η εντολή μέσα σε αυτήν την else θα εκτελεστεί εφόσον δεν ισχύουν η παραπάνω if/elif ή οι παραπάνω if/elif(s) 
else:
    print "Den Perase - Mesos Oros:", mo
