# coding: utf-8

# το 'coding: utf-8' χρησιμεύει για να μπορούμε να γράφουμε Ελληνικά στο πρόγραμμα μας 

"""
όταν λέμε μέσα στην if/elif/else εννοούμε τις εντολές που βρίσκονται κάτω από
από την if/elif/else και έχουν λίγο κενό στην αρχή, μόλις φτάσουμε στην επόμενη
εντολή που δεν έχει κενό στην αρχή, σημαίνει οτι έχουμε πλεόν βγεί από
την if/elif/else και προχωρήσαμε στην επόμενη εντολή. το (if) το χρησιμοποιούμε για
την πρώτη περίπτωση/συνθήκη συνήθως και την (elif -> else if) την χρησιμοποιούμε
για τις ενδυάμεσες περιπτώσεις/συνθήκες και όταν δεν έχουν μείνει πλέον άλλες περιπτώσεις/συνθήκες
να καλύψουμε, αλλά θέλουμε να είμαστε όσο το δυνατό πιο σίγουροι οτι τις καλύψαμε όλες,
χρησιμοποιούμε την (else) η οποία θα τρέξει σε περίπτωση που δεν ισχύει καμία από τις παραπάνω
περιπτώσεις/συνθήκες.
"""

"""
1) Το 'int' το χρησιμοποιούμε όταν αυτό που θα δώσει ο χρήστης από το πληκτρολόγιο είναι ακέραιος ή θέλουμε να είμαστε σίγουροι οτι θα είναι ακέραιος
2) Το 'float' το χρησιμοποιούμε όταν αυτό που θα δώσει ο χρήστης από το πληκτρολόγιο είναι πραγματικός ή θέλουμε να είμαστε σίγουροι οτι θα είναι πραγματικός
3) Το 'string' το χρησιμοποιούμε όταν αυτό που θα δώσει ο χρήστης από το πληκτρολόγιο είναι κείμενο ή θέλουμε να είμαστε σίγουροι οτι θα είναι κείμενο
"""


# !!! Τα παραπάνω είναι σχόλια δεν χρησιμεύουν σε κάτι, Πέρα από το να βοηθάνε τον προγραμματιστή που γράφει το πρόγραμμα. Τα σχόλια πρέπει να ξεκινάνε με αυτό το σύμβολο '#' για σχόλιο μίας γραμμής 
# !!! ή αυτό """ και ξανά αυτό """ για να κλείσει το σχόλιο αν θέλουμε να γράψουμε """σχόλιο πολλών γραμμών""" και γράφουμε ανάμεσα
# !!! Πέρα από το να βοηθάνε τον προγραμματιστή που γράφει το πρόγραμμα
# ------------------------------------------------------------------------------------------------------------------------------------------------------------




# Μερικοί αριθμοί για να δοκιμάσετε και να σιγουρέψετε οτι το πρόγραμμα λειτουργεί σωστά
# 500 -> 50
# 1800 -> 210
# 2500 -> 400
# 3500 -> 800


# Ζητάει από τον χρήστη να δώσει από το πληκτρολόγιο λεπτά ομιλίας που μίλησε αυτόν τον μήνα
minutes = float(input("dwse lepta omilias: "))

# Η εντολή μέσα σε αυτήν την if θα εκτελεστεί εφόσον τα λεπτά που έδωσε ο χρήστης είναι έως 1500
if minutes <= 1500:
    
    # υπολογίζει το συνολικό κόστος σύμφωνα με την χρέωση για το κάθε λεπτό και τα λεπτά μου μίλησε ο χρήστης αυτόν τον μήνα
    
    # Συνολικο_Κόστος = λεπτά_που_μίλησε_ο_χρήστης * την χρέωση_για_το_κάθε_λεπτό
    cost = minutes * 0.1
    print(cost)

# Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί εφόσον τα λεπτά που έδωσε ο χρήστης είναι παραπάνω από 1500 και έως και 2000(1501-2000)
elif (minutes > 1500) and (minutes <= 2000):
    
    # υπολογίζει το συνολικό κόστος σύμφωνα με την χρέωση για το κάθε λεπτό και τα λεπτά μου μίλησε ο χρήστης αυτόν τον μήνα
    # εδώ πέρα έχουμε σίγουρα λεπτά ομιλίας που έδωσε ο χρήστης πάνω από 1500
    # οπότε από αυτά τα 1500 θα πάνε με την πρώτη χρέωση δηλαδή 0.1 και τα υπόλοιπα θα πάνε με την δεύτερη δηλαδή 0.2
    
    # Συνολικο_Κόστος = (1500 * πρώτη_χρέωση(0.1)) + ((λεπτά_που_μίλησε_ο_χρήστης - 1500) * 0.2)
    cost = (1500 * 0.1) + ((minutes - 1500) * 0.2)
    print(cost)

# Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί εφόσον τα λεπτά που έδωσε ο χρήστης είναι παραπάνω από 2000 και έως και 3000(2001-3000)   
elif (minutes > 2000) and (minutes <= 3000):
    
    # υπολογίζει το συνολικό κόστος σύμφωνα με την χρέωση για το κάθε λεπτό και τα λεπτά μου μίλησε ο χρήστης αυτόν τον μήνα
    # εδώ πέρα έχουμε σίγουρα λεπτά ομιλίας που έδωσε ο χρήστης πάνω από 2000
    # οπότε από αυτά τα 1500 θα πάνε με την πρώτη χρέωση δηλαδή 0.1, τα 500 θα πάνε με την δεύτερη χρέσωση δηλαδή 0.2 και τα υπόλοιπα θα πάνε με την τρίτη δηλαδή 0.3
    
    # Συνολικο_Κόστος = (1500 * πρώτη_χρέωση(0.1)) + (500 * δεύτερη_χρέσωση(0.2)) + ((λεπτά_που_μίλησε_ο_χρήστης - 2000) * 0.3)
    cost = (1500 * 0.1) + (500 * 0.2) + ((minutes - 2000) * 0.3)
    print(cost)

# Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί εφόσον τα λεπτά που έδωσε ο χρήστης είναι παραπάνω από 3000 και έως και 4000(3001-4000) 
elif (minutes > 3000) and (minutes <= 4000):
    
    # υπολογίζει το συνολικό κόστος σύμφωνα με την χρέωση για το κάθε λεπτό και τα λεπτά μου μίλησε ο χρήστης αυτόν τον μήνα
    # εδώ πέρα έχουμε σίγουρα λεπτά ομιλίας που έδωσε ο χρήστης πάνω από 3000
    # οπότε από αυτά τα 1500 θα πάνε με την πρώτη χρέωση δηλαδή 0.1, τα 500 θα πάνε με την δεύτερη χρέσωση δηλαδή 0.2, τα 1000 θα πάνε με την τρίτη χρέωση δηλαδή 0.3
    # και τα υπόλοιπα θα πάνε στην τέταρτη χρέωση δηλαδή 0.5
    
    # Συνολικο_Κόστος = (1500 * πρώτη_χρέωση(0.1)) + (500 * δεύτερη_χρέσωση(0.2)) + (1000 * τρίτη_χρέωση(0.3)) + ((λεπτά_που_μίλησε_ο_χρήστης - 3000) * 0.5)
    cost = (1500 * 0.1) + (500 * 0.2) + (1000 * 0.3) + ((minutes - 3000) * 0.5)
    print(cost)
