# coding: utf-8

""" Διαίρεση με το 25 - Χωρίς υπόλοιπο """


# counter που θα μετράει το πλήθος των αριθμών που μπορούν να διερεθούν με το 25 ακριβώς και να δώσουν 0, με αρχική τιμή 0
mod25Count = 0

# επανάληψη for η οποία περνάει από όλους τους αριθμούς μέχρι το 10000
for i in range(1, 10000+1, 1):

    # ελέγχει να ο τρέχον αριθμός διαιρείται ακριβώς με το 25
    if i % 25 == 0:
        
        # αυξάνει το κατά ένα τον counter εφόσον ο αριθμός διαιρείται
        mod25Count+=1


# εμφανίζει το πλήθος των αριθμών που διαιρούνται ακριβώς με το 25
print("Oi arithmoi pou dierountai akrivos me to 25 einai: ", mod25Count)
