# coding: utf-8

# το 'coding: utf-8' χρησιμεύει για να μπορούμε να γράφουμε Ελληνικά στο πρόγραμμα μας 

"""
όταν λέμε μέσα στην if/elif/else εννοούμε τις εντολές που βρίσκονται κάτω από
από την if/elif/else και έχουν λίγο κενό στην αρχή, μόλις φτάσουμε στην επόμενη
εντολή που δεν έχει κενό στην αρχή, σημαίνει οτι έχουμε πλεόν βγεί από
την if/elif/else και προχωρήσαμε στην επόμενη εντολή. το (if) το χρησιμοποιούμε για
την πρώτη περίπτωση/συνθήκη συνήθως και την (elif -> else if) την χρησιμοποιούμε
για τις ενδυάμεσες περιπτώσεις/συνθήκες και όταν δεν έχουν μείνει πλέον άλλες περιπτώσεις/συνθήκες
να καλύψουμε, αλλά θέλουμε να είμαστε όσο το δυνατό πιο σίγουροι οτι τις καλύψαμε όλες,
χρησιμοποιούμε την (else) η οποία θα τρέξει σε περίπτωση που δεν ισχύει καμία από τις παραπάνω
περιπτώσεις/συνθήκες.
"""

"""
1) Το 'int' το χρησιμοποιούμε όταν αυτό που θα δώσει ο χρήστης από το πληκτρολόγιο είναι ακέραιος ή θέλουμε να είμαστε σίγουροι οτι θα είναι ακέραιος
2) Το 'float' το χρησιμοποιούμε όταν αυτό που θα δώσει ο χρήστης από το πληκτρολόγιο είναι πραγματικός ή θέλουμε να είμαστε σίγουροι οτι θα είναι πραγματικός
3) Το 'string' το χρησιμοποιούμε όταν αυτό που θα δώσει ο χρήστης από το πληκτρολόγιο είναι κείμενο ή θέλουμε να είμαστε σίγουροι οτι θα είναι κείμενο
"""

# Χειμώνας: Δεκέμβριος, Ιανουάριος, Φεβρουάριος
# Άνοιξη: Μάρτιος, Απρίλιος, Μάιος
# Φθινόπωρο: Σεπτέμβριος, Οκτώβριος, Νοέμβριος
# Καλοκαίρι: Ιούνιος, Ιούλιος, Αύγουστος


# !!! Τα παραπάνω είναι σχόλια δεν χρησιμεύουν σε κάτι, Πέρα από το να βοηθάνε τον προγραμματιστή που γράφει το πρόγραμμα. Τα σχόλια πρέπει να ξεκινάνε με αυτό το σύμβολο '#' για σχόλιο μίας γραμμής 
# !!! ή αυτό """ και ξανά αυτό """ για να κλείσει το σχόλιο αν θέλουμε να γράψουμε """σχόλιο πολλών γραμμών""" και γράφουμε ανάμεσα
# !!! Πέρα από το να βοηθάνε τον προγραμματιστή που γράφει το πρόγραμμα
# ------------------------------------------------------------------------------------------------------------------------------------------------------------



# Ζητάει από τον χρήστη να δώσει από το πληκτρολόγιο έναν από τους 12 μήνες, με αριθμό π.χ. 1 για Ιανουάριος, 2 για Φεβρουάριος κτλπ.
month=int(input("dwse mhna (1-12): "))

# Ζητάει από τον χρήστη να δώσει από το πληκτρολόγιο θερμοκρασία
temperature=float(input("dwse thermokrasia: "))

# Η εντολή μέσα σε αυτήν την if θα εκτελεστεί αν ο μήνας που δώσαμε είναι ο 12ος, ο 1ος ή ο 2ος
if month == 12 or month == 1 or month == 2:
    print "Season: Winter", " | Month: ", month, " | Temperature: ", temperature

    # Η εντολή μέσα σε αυτήν την if θα εκτελεστεί αν η θερμοκρασία που δώσαμε είναι μικρότερη ή ίση του 0
    if temperature <=0:
        print "Kryo"
    # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί αν η θερμοκρασία που δώσαμε είναι ανάμεσα στο 0 και στο 10
    # περιλαμβάνετε και το 10
    elif (temperature > 0) and (temperature <= 10):
        print "Fysiologikh"
    # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί αν η θερμοκρασία που δώσαμε είναι μεγαλύτερη από το 10
    elif (temperature > 10):
        print "Kalos Kairos!"

# Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί αν ο μήνας που δώσαμε είναι ο 3ος, ο 4ος ή ο 5ος
elif month == 3 or month == 4 or month == 5:
    print "Season: Spring", " | Month: ", month, " | Temperature: ", temperature

    # Η εντολή μέσα σε αυτήν την if θα εκτελεστεί αν η θερμοκρασία που δώσαμε είναι μικρότερη ή ίση του 10
    if temperature <= 10:
        print "Kryo"
    # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί αν η θερμοκρασία που δώσαμε είναι ανάμεσα στο 10 και στο 18
    # περιλαμβάνετε και το 18
    elif (temperature > 10) and (temperature <= 18):
        print "Fysiologikh"
    # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί αν η θερμοκρασία που δώσαμε είναι μεγαλύερη από το 18
    elif (temperature > 18):
        print "Kalos Kairos!"

# Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί αν ο μήνας που δώσαμε είναι ο 9ος, ο 10ος ή ο 11ος
elif month == 9 or month == 10 or month == 11:
    print "Season: Autumn", " | Month: ", month, " | Temperature: ", temperature

    # Η εντολή μέσα σε αυτήν την if θα εκτελεστεί αν η θερμοκρασία που δώσαμε είναι μικρότερη ή ίση του 10
    if temperature <= 10:
        print "Kryo"
    # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί αν η θερμοκρασία που δώσαμε είναι ανάμεσα στο 10 και στο 18
    # περιλαμβάνετε και το 18
    elif (temperature > 10) and (temperature <= 18):
        print "Fysiologikh"
    # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί αν η θερμοκρασία που δώσαμε είναι μεγαλύερη από το 18
    elif (temperature > 18):
        print "Kalos Kairos!"

# Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί αν ο μήνας που δώσαμε είναι ο 6ος, ο 7ος ή ο 8ος
elif month == 6 or month == 7 or month == 8:
    print("Season: Summer", " | Month: ", month, " | Temperature: ", temperature)

    # Η εντολή μέσα σε αυτήν την if θα εκτελεστεί αν η θερμοκρασία που δώσαμε είναι μικρότερη ή ίση του 25
    if temperature <= 25:
        print "etsi kai etsi"
    # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί αν η θερμοκρασία που δώσαμε είναι ανάμεσα στο 25 και στο 35
    # περιλαμβάνετε και το 18
    elif (temperature > 25) and (temperature <= 35):
        print "Kalos Kairos!"
    # Η εντολή μέσα σε αυτήν την elif θα εκτελεστεί αν η θερμοκρασία που δώσαμε είναι μεγαλύερη από το 35
    elif (temperature > 35):
        print "Kapsonas"
