# coding: utf-8

""" Τετράγωνο, κύβος και ρίζα ενός πολλών αριθμού """


# καλούμε την βιβλιοθήκη math στην οποία περιλαμβάνονται και λειτουργίες από μαθηματικές πράξεις που θα χρειαστούμε
import math

# περιμένει από τον χρήστη να δώσει έναν ακέραιο αριθμό από το πληκτρολόγιο
num=int(input("dwse arithmo: "))

# έπειτα κάνει μια επανάληψη όσες φορές, όσες και ο αριθμός που έδωσε ο χρήστης
# και βρίσκει το τετράγωνο(εις την δευτέρα), τον κύβο(εις την τρίτη) και την ρίζα
# του κάθε αριθμού
for i in range(1, num+1, 1):
    square=math.pow(i, 2)
    cube=math.pow(i, 3)
    square_root=math.sqrt(i)

    # τέλος τα εμφανίζει για τον κάθε αριθμό
    print(f"num={i}, square={square}, cube={cube}, square_root={square_root}")
