# coding: utf-8

""" Ταξινόμηση λίστας αριθμών """


# λίστα με αριθμούς
numList = [2, 1, 4, 3, 5]

# μέγεθος της λίστας
listLength = len(numList)

# διπλή επανάληψη for, η πρώτη εκτελείται μέχρι τον αριθμό μεγέθους της λίστας από τα αριστερά προς τα δεξιά μέχρι να φτάσει στον τελευταίο αριθμό της λίστας
# δηλαδή πάει κανονικά με θετικό βήμα 1
for i in range(1, listLength+1, 1):
    
    # η δεύερη εκτελείται από τα δεξιά προς τα αριστερά μέχρι να φτάσει έναν αριθμό πριν τον τελευταίο αριθμό της λίστας
    # δηλαδή πάει ανάποδα με αρνητικό βήμα -1
    for j in range(listLength-1, i-1, -1):

        # εφόσον ο αριθμός που δείχνει τώρα το j είναι μικρότερος από τον αριθμό που έδειχνε προηγουμένος το j(δηλαδή j-1) στην λίστα, κάνε ανταλλαγή μεταξύ τους
        # π.χ. [2, 1, 4, 3, 5] το 3 είναι μικρότερο του 4 άρα [2, 1, 3, 4, 5]
        # και αυτό θα εκτελεστει μέχρι οι αριθμοί να μπούνε από τον μικρότερο στον μεγαλύερο δηλαδή [1, 2, 3, 4, 5]
        # αν θέλαμε να κάνουμε από τον μεγαλύερο στο μικρότερο απλά θα αλλάζαμε το < πιο κάτω με >
        if (numList[j] < numList[j - 1]):
            numList[j-1], numList[j] = numList[j], numList[j-1]


# θα εμφανίσει την λίστα ταξινομημένη
print(numList)
