# coding: utf-8

""" Ταξινόμηση λίστας ονομάτων και επιθέτων σύμφωνα με την λίστα των επιθέτων """


# 2 άδειες λίστες μία στην οποία θα μπουν τα ονόματα και μία στην οποία θα μπούν τα επίθετα
fNameList = []
lNameList = []

# δίνουμε μέγεθος και των 2 λιστών από τον πληκτρολόγιο
listLength = int(input("Dwse megethos listas: "))

# κάνουμε μια επανάληψη for, η οποία θα εκτελείται μέχρι να φτάσει στον αριθμό που έδωσε ο χρήστης
# με βήμα 1
# κάθε φορά που θα εκτελείτε θα ζητάει από τον χρήστη, να δώσει από το πληκτρολόγιο το όνομα και το επίθετο ξεχωριστά
# τα οποία μετά θα εισάγει το καθένα στην κατάλληλη λίστα 
# αμα είναι λίστα στην λίστα με τα ονόματα, άμα είναι επίθετο στην λίστα με τα επίθετα
for i in range(1, listLength+1, 1):
    fname = str(input("Dwse onoma: "))
    lname = str(input("Dwse epitheto: "))
    fNameList.append(fname)
    lNameList.append(lname)


# θα κάνει ταξινόμηση με αλφαβητική σειρά από το a-z, σύμφωνα με το πρώτο γράμμα του επιθέτου
# διπλή επανάληψη for, η πρώτη εκτελείται μέχρι τον αριθμό μεγέθους της λίστας από τα αριστερά προς τα δεξιά μέχρι να φτάσει στο τελευταίο στοιχείο(όνομα, επίθετο) των λιστών
# δηλαδή πάει κανονικά με θετικό βήμα 1
for i in range(1, listLength, 1):

    # η δεύερη εκτελείται από τα δεξιά προς τα αριστερά μέχρι να φτάσει έναν στοιχείο πριν τον τελευταίο στοιχείο(όνομα, επίθετο) της λίστας
    # δηλαδή πάει ανάποδα με αρνητικό βήμα -1
    for j in range(listLength-1, i-1, -1):

        # εφόσον το πρώτο γράμμα του επιθέτου που δείχνει τώρα το j προηγείτεαι αλφαβητικά από αυτό που έδειχνε προηγουμένος 
        # το j(δηλαδή j-1) στην λίστα, κάνε ανταλλαγή μεταξύ των επιθέτων και ταυτόχρονα άλλαξε και τα ονόματα
        # και αυτό θα εκτελεστει μέχρι οι τα επίθετα να μπουν σε αλφαβητική σειρά από το a-z
        # αν θέλαμε να κάνουμε από το z-a απλά θα αλλάζαμε το < πιο κάτω με >
        if (lNameList[j] < lNameList[j - 1]):
            lNameList[j-1], lNameList[j] = lNameList[j], lNameList[j-1]
            fNameList[j-1], fNameList[j] = fNameList[j], fNameList[j-1]
        

# εμφανίζει την λίστα με τα επίθετα και την λίστα με τα ονόματα
print(fNameList, lNameList)
